cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'mas'
brew 'cowsay'
brew 'autoconf'
brew 'automake'
brew 'figlet'
brew 'lua'
brew 'gawk'
brew 'jq'
brew 'nkf'
brew 'openssl'
brew 'pkg-config'
brew 'curl'
brew 'gettext'
brew 'libpng'
brew 'freetype'
brew 'tig', args: ['with-docs']
brew 'libtool'
brew 'icu4c'
brew 'jpeg'
brew 'libevent'
brew 'libyaml'
brew 'mhash'
brew 'mcrypt'
brew 'rbenv'
brew 'ruby-build'
brew 're2c'
brew 'readline'
brew 'direnv'
brew 'fzf'
brew 'tmux'
brew 'wget'
brew 'node.js'
brew 'nodebrew'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'phpbrew'
brew 'htop-osx'
brew 'zsh', args: ['without-etcdir']
brew 'zsh-completions'
brew 'bison'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'libxml2'
brew 'lemon'
brew 'zlib'
brew 'reattach-to-user-namespace'
brew 'ansible'
brew 'gradle'
brew 'tree'
brew 'rename'
brew 'libjpeg'
brew 'hub'
brew 'colordiff'
brew 'psutils'
brew 'pkill'
brew 'pcre'
brew 'gmp'
brew 'ctags'
brew 'lynx'

# cask 'alfred'
# cask 'iterm2'
# cask 'atom'
cask 'skitch'
cask 'the-unarchiver'
cask 'google-japanese-ime'
cask 'virtualbox'
cask 'vagrant'
cask 'karabiner'
cask 'maczip4win'
